tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf47k40_tdd.h
#define PSCNT11                       522
#define WDTPSCNT11                    523
#define PSCNT12                       524
#define WDTPSCNT12                    525
#define PSCNT13                       526
#define WDTPSCNT13                    527
#define PSCNT14                       528
#define WDTPSCNT14                    529
#define PSCNT15                       530
#define WDTPSCNT15                    531
#define PSCNT16                       532
#define WDTPSCNT16                    533
#define WDTPSCNT17                    534
#define PSCNT17                       535
#define STATE                         536
#define WDTSTATE                      537
#define WDTTMR                        538
#define WDTTMR0                       539
#define WDTTMR1                       540
#define WDTTMR2                       541
#define WDTTMR3                       542
#define WDTTMR4                       543
#define CPUDOZE                       544
#define DOZE0                         545
#define DOZE                          546
#define DOZE1                         547
#define DOZE2                         548
#define DOE                           549
#define ROI                           550
#define DOZEN                         551
#define IDLEN                         552
#define OSCCON1                       553
#define NDIV0                         554
#define NDIV                          555
#define NDIV1                         556
#define NDIV2                         557
#define NDIV3                         558
#define NOSC0                         559
#define NOSC                          560
#define NOSC1                         561
#define NOSC2                         562
#define OSCCON2                       563
#define CDIV0                         564
#define CDIV                          565
#define CDIV1                         566
#define CDIV2                         567
#define CDIV3                         568
#define COSC                          569
#define COSC0                         570
#define COSC1                         571
#define COSC2                         572
#define OSCCON3                       573
#define NOSCR                         574
#define ORDY                          575
#define SOSCPWR                       576
#define CSWHOLD                       577
#define OSCSTAT                       578
#define PLLR                          579
#define ADOR                          580
#define SOR                           581
#define LFOR                          582
#define MFOR                          583
#define HFOR                          584
#define EXTOR                         585
#define OSCEN                         586
#define ADOEN                         587
#define SOSCEN                        588
#define LFOEN                         589
#define MFOEN                         590
#define HFOEN                         591
#define EXTOEN                        592
#define OSCTUNE                       593
#define TUN0                          594
#define TUN                           595
#define TUN1                          596
#define TUN2                          597
#define TUN3                          598
#define TUN4                          599
#define TUN5                          600
#define OSCFRQ                        601
#define HFFRQ                         602
#define FRQ0                          603
#define FRQ1                          604
#define FRQ2                          605
#define FRQ3                          606
#define BORCON                        607
#define BORRDY                        608
#define SBOREN                        609
#define PMD0                          610
#define IOCMD                         611
#define CLKRMD                        612
#define SPI1MD                        613
#define SPI2MD                        614
#define NVMMD                         615
#define SCANMD                        616
#define CRCMD                         617
#define HLVDMD                        618
#define FVRMD                         619
#define SYSCMD                        620
#define PMD1                          621
#define EMBMD                         622
#define TMR0MD                        623
#define TMR1MD                        624
#define TMR2MD                        625
#define TMR3MD                        626
#define TMR4MD                        627
#define TMR5MD                        628
#define TMR6MD                        629
#define PMD2                          630
#define ZCDMD                         631
#define CMP1MD                        632
#define CMP2MD                        633
#define ADCMD                         634
#define DACMD                         635
#define PMD3                          636
#define CCP1MD                        637
#define CCP2MD                        638
#define PWM3MD                        639
#define PWM4MD                        640
#define PMD4                          641
#define CWGMD                         642
#define CWG1MD                        643
#define MSSP1MD                       644
#define MSSP2MD                       645
#define UART1MD                       646
#define UART2MD                       647
#define PMD5                          648
#define DSMMD                         649
#define RA0PPS                        650
#define RA0PPS0                       651
#define RA0PPS1                       652
#define RA0PPS2                       653
#define RA0PPS3                       654
#define RA0PPS4                       655
#define RA1PPS                        656
#define RA1PPS0                       657
#define RA1PPS1                       658
#define RA1PPS2                       659
#define RA1PPS3                       660
#define RA1PPS4                       661
#define RA2PPS                        662
#define RA2PPS0                       663
#define RA2PPS1                       664
#define RA2PPS2                       665
#define RA2PPS3                       666
#define RA2PPS4                       667
#define RA3PPS                        668
#define RA3PPS0                       669
#define RA3PPS1                       670
#define RA3PPS2                       671
#define RA3PPS3                       672
#define RA3PPS4                       673
#define RA4PPS                        674
#define RA4PPS0                       675
#define RA4PPS1                       676
#define RA4PPS2                       677
#define RA4PPS3                       678
#define RA4PPS4                       679
#define RA5PPS                        680
#define RA5PPS0                       681
#define RA5PPS1                       682
#define RA5PPS2                       683
#define RA5PPS3                       684
#define RA5PPS4                       685
#define RA6PPS                        686
#define RA6PPS0                       687
#define RA6PPS1                       688
#define RA6PPS2                       689
#define RA6PPS3                       690
#define RA6PPS4                       691
#define RA7PPS                        692
#define RA7PPS0                       693
#define RA7PPS1                       694
#define RA7PPS2                       695
#define RA7PPS3                       696
#define RA7PPS4                       697
#define RB0PPS                        698
#define RB0PPS0                       699
#define RB0PPS1                       700
#define RB0PPS2                       701
#define RB0PPS3                       702
#define RB0PPS4                       703
#define RB1PPS                        704
#define RB1PPS0                       705
#define RB1PPS1                       706
#define RB1PPS2                       707
#define RB1PPS3                       708
#define RB1PPS4                       709
#define RB2PPS                        710
#define RB2PPS0                       711
#define RB2PPS1                       712
#define RB2PPS2                       713
#define RB2PPS3                       714
#define RB2PPS4                       715
#define RB3PPS                        716
#define RB3PPS0                       717
#define RB3PPS1                       718
#define RB3PPS2                       719
#define RB3PPS3                       720
#define RB3PPS4                       721
#define RB4PPS                        722
#define RB4PPS0                       723
#define RB4PPS1                       724
#define RB4PPS2                       725
#define RB4PPS3                       726
#define RB4PPS4                       727
#define RB5PPS                        728
#define RB5PPS0                       729
#define RB5PPS1                       730
#define RB5PPS2                       731
#define RB5PPS3                       732
#define RB5PPS4                       733
#define RB6PPS                        734
#define RB6PPS0                       735
#define RB6PPS1                       736
#define RB6PPS2                       737
#define RB6PPS3                       738
#define RB6PPS4                       739
#define RB7PPS                        740
#define RB7PPS0                       741
#define RB7PPS1                       742
#define RB7PPS2                       743
#define RB7PPS3                       744
#define RB7PPS4                       745
#define RC0PPS                        746
#define RC0PPS0                       747
#define RC0PPS1                       748
#define RC0PPS2                       749
#define RC0PPS3                       750
#define RC0PPS4                       751
#define RC1PPS                        752
#define RC1PPS0                       753
#define RC1PPS1                       754
#define RC1PPS2                       755
#define RC1PPS3                       756
#define RC1PPS4                       757
#define RC2PPS                        758
#define RC2PPS0                       759
#define RC2PPS1                       760
#define RC2PPS2                       761
#define RC2PPS3                       762
#define RC2PPS4                       763
#define RC3PPS                        764
#define RC3PPS0                       765
#define RC3PPS1                       766
#define RC3PPS2                       767
#define RC3PPS3                       768
#define RC3PPS4                       769
#define RC4PPS                        770
#define RC4PPS0                       771
#define RC4PPS1                       772
#define RC4PPS2                       773
#define RC4PPS3                       774
#define RC4PPS4                       775
#define RC5PPS                        776
#define RC5PPS0                       777
#define RC5PPS1                       778
#define RC5PPS2                       779
#define RC5PPS3                       780
#define RC5PPS4                       781
#define RC6PPS                        782
#define RC6PPS0                       783
#define RC6PPS1                       784
#define RC6PPS2                       785
#define RC6PPS3                       786
#define RC6PPS4                       787
#define RC7PPS                        788
#define RC7PPS0                       789
#define RC7PPS1                       790
#define RC7PPS2                       791
#define RC7PPS3                       792
#define RC7PPS4                       793
#define RD0PPS                        794
#define RD0PPS0                       795
#define RD0PPS1                       796
#define RD0PPS2                       797
#define RD0PPS3                       798
#define RD0PPS4                       799
#define RD1PPS                        800
#define RD1PPS0                       801
#define RD1PPS1                       802
#define RD1PPS2                       803
#define RD1PPS3                       804
#define RD1PPS4                       805
#define RD2PPS                        806
#define RD2PPS0                       807
#define RD2PPS1                       808
#define RD2PPS2                       809
#define RD2PPS3                       810
#define RD2PPS4                       811
#define RD3PPS                        812
#define RD3PPS0                       813
#define RD3PPS1                       814
#define RD3PPS2                       815
#define RD3PPS3                       816
#define RD3PPS4                       817
#define RD4PPS                        818
#define RD4PPS0                       819
#define RD4PPS1                       820
#define RD4PPS2                       821
#define RD4PPS3                       822
#define RD4PPS4                       823
#define RD5PPS                        824
#define RD5PPS0                       825
#define RD5PPS1                       826
#define RD5PPS2                       827
#define RD5PPS3                       828
#define RD5PPS4                       829
#define RD6PPS                        830
#define RD6PPS0                       831
#define RD6PPS1                       832
#define RD6PPS2                       833
#define RD6PPS3                       834
#define RD6PPS4                       835
#define RD7PPS                        836
#define RD7PPS0                       837
#define RD7PPS1                       838
#define RD7PPS2                       839
#define RD7PPS3                       840
#define RD7PPS4                       841
#define RE0PPS                        842
#define RE0PPS0                       843
#define RE0PPS1                       844
#define RE0PPS2                       845
#define RE0PPS3                       846
#define RE0PPS4                       847
#define RE1PPS                        848
#define RE1PPS0                       849
#define RE1PPS1                       850
#define RE1PPS2                       851
#define RE1PPS3                       852
#define RE1PPS4                       853
#define RE2PPS                        854
#define RE2PPS0                       855
#define RE2PPS1                       856
#define RE2PPS2                       857
#define RE2PPS3                       858
#define RE2PPS4                       859
#define IOCAF                         860
#define IOCAF0                        861
#define IOCAF1                        862
#define IOCAF2                        863
#define IOCAF3                        864
#define IOCAF4                        865
#define IOCAF5                        866
#define IOCAF6                        867
#define IOCAF7                        868
#define IOCAN                         869
#define IOCAN0                        870
#define IOCAN1                        871
#define IOCAN2                        872
#define IOCAN3                        873
#define IOCAN4                        874
#define IOCAN5                        875
#define IOCAN6                        876
#define IOCAN7                        877
#define IOCAP                         878
#define IOCAP0                        879
#define IOCAP1                        880
#define IOCAP2                        881
#define IOCAP3                        882
#define IOCAP4                        883
#define IOCAP5                        884
#define IOCAP6                        885
#define IOCAP7                        886
#define INLVLA                        887
#define INLVLA0                       888
#define INLVLA1                       889
#define INLVLA2                       890
#define INLVLA3                       891
#define INLVLA4                       892
#define INLVLA5                       893
#define INLVLA6                       894
#define INLVLA7                       895
#define SLRCONA                       896
#define SLRA0                         897
#define SLRA1                         898
#define SLRA2                         899
#define SLRA3                         900
#define SLRA4                         901
#define SLRA5                         902
#define SLRA6                         903
#define SLRA7                         904
#define ODCONA                        905
#define ODCA0                         906
#define ODCA1                         907
#define ODCA2                         908
#define ODCA3                         909
#define ODCA4                         910
#define ODCA5                         911
#define ODCA6                         912
#define ODCA7                         913
#define WPUA                          914
#define WPUA0                         915
#define WPUA1                         916
#define WPUA2                         917
#define WPUA3                         918
#define WPUA4                         919
#define WPUA5                         920
#define WPUA6                         921
#define WPUA7                         922
#define ANSELA                        923
#define ANSELA0                       924
#define ANSELA1                       925
#define ANSELA2                       926
#define ANSELA3                       927
#define ANSELA4                       928
#define ANSELA5                       929
#define ANSELA6                       930
#define ANSELA7                       931
#define IOCBF                         932
#define IOCBF0                        933
#define IOCBF1                        934
#define IOCBF2                        935
#define IOCBF3                        936
#define IOCBF4                        937
#define IOCBF5                        938
#define IOCBF6                        939
#define IOCBF7                        940
#define IOCBN                         941
#define IOCBN0                        942
#define IOCBN1                        943
#define IOCBN2                        944
#define IOCBN3                        945
#define IOCBN4                        946
#define IOCBN5                        947
#define IOCBN6                        948
#define IOCBN7                        949
#define IOCBP                         950
#define IOCBP0                        951
#define IOCBP1                        952
#define IOCBP2                        953
#define IOCBP3                        954
#define IOCBP4                        955
#define IOCBP5                        956
#define IOCBP6                        957
#define IOCBP7                        958
#define INLVLB                        959
#define INLVLB0                       960
#define INLVLB1                       961
#define INLVLB2                       962
#define INLVLB3                       963
#define INLVLB4                       964
#define INLVLB5                       965
#define INLVLB6                       966
#define INLVLB7                       967
#define SLRCONB                       968
#define SLRB0                         969
#define SLRB1                         970
#define SLRB2                         971
#define SLRB3                         972
#define SLRB4                         973
#define SLRB5                         974
#define SLRB6                         975
#define SLRB7                         976
#define ODCONB                        977
#define ODCB0                         978
#define ODCB1                         979
#define ODCB2                         980
#define ODCB3                         981
#define ODCB4                         982
#define ODCB5                         983
#define ODCB6                         984
#define ODCB7                         985
#define WPUB                          986
#define WPUB0                         987
#define WPUB1                         988
#define WPUB2                         989
#define WPUB3                         990
#define WPUB4                         991
#define WPUB5                         992
#define WPUB6                         993
#define WPUB7                         994
#define ANSELB                        995
#define ANSELB0                       996
#define ANSELB1                       997
#define ANSELB2                       998
#define ANSELB3                       999
#define ANSELB4                       1000
#define ANSELB5                       1001
#define ANSELB6                       1002
#define ANSELB7                       1003
#define IOCCF                         1004
#define IOCCF0                        1005
#define IOCCF1                        1006
#define IOCCF2                        1007
#define IOCCF3                        1008
#define IOCCF4                        1009
#define IOCCF5                        1010
#define IOCCF6                        1011
#define IOCCF7                        1012
#define IOCCN                         1013
#define IOCCN0                        1014
#define IOCCN1                        1015
#define IOCCN2                        1016
#define IOCCN3                        1017
#define IOCCN4                        1018
#define IOCCN5                        1019
#define IOCCN6                        1020
#define IOCCN7                        1021
#define IOCCP                         1022
#define IOCCP0                        1023
#define IOCCP1                        1024
#define IOCCP2                        1025
#define IOCCP3                        1026
#define IOCCP4                        1027
#define IOCCP5                        1028
#define IOCCP6                        1029
#define IOCCP7                        1030
#define INLVLC                        1031
#define INLVLC0                       1032
#define INLVLC1                       1033
#define INLVLC2                       1034
#define INLVLC3                       1035
#define INLVLC4                       1036
#define INLVLC5                       1037
#define INLVLC6                       1038
#define INLVLC7                       1039
#define SLRCONC                       1040
#define SLRC0                         1041
#define SLRC1                         1042
#define SLRC2                         1043
#define SLRC3                         1044
#define SLRC4                         1045
#define SLRC5                         1046
#define SLRC6                         1047
#define SLRC7                         1048
#define ODCONC                        1049
#define ODCC0                         1050
#define ODCC1                         1051
#define ODCC2                         1052
#define ODCC3                         1053
#define ODCC4                         1054
#define ODCC5                         1055
#define ODCC6                         1056
#define ODCC7                         1057
#define WPUC                          1058
#define WPUC0                         1059
#define WPUC1                         1060
#define WPUC2                         1061
#define WPUC3                         1062
#define WPUC4                         1063
#define WPUC5                         1064
#define WPUC6                         1065
#define WPUC7                         1066
#define ANSELC                        1067
#define ANSELC0                       1068
#define ANSELC1                       1069
#define ANSELC2                       1070
#define ANSELC3                       1071
#define ANSELC4                       1072
#define ANSELC5                       1073
#define ANSELC6                       1074
#define ANSELC7                       1075
#define INLVLD                        1076
#define INLVLD0                       1077
#define INLVLD1                       1078
#define INLVLD2                       1079
#define INLVLD3                       1080
#define INLVLD4                       1081
#define INLVLD5                       1082
#define INLVLD6                       1083
#define INLVLD7                       1084
#define SLRCOND                       1085
#define SLRD0                         1086
#define SLRD1                         1087
#define SLRD2                         1088
#define SLRD3                         1089
#define SLRD4                         1090
