tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf47k40_tdd.h
#define T5GATE_GSS                    2765
#define T5GATE_GSS1                   2766
#define T5GSS1                        2767
#define T5GATE_GSS2                   2768
#define T5GSS2                        2769
#define T5GATE_GSS3                   2770
#define T5GSS3                        2771
#define T5CLK                         2772
#define T5CS0                         2773
#define T5CLK_CS                      2774
#define T5CLK_CS0                     2775
#define T5CS1                         2776
#define T5CLK_CS1                     2777
#define T5CS2                         2778
#define T5CLK_CS2                     2779
#define T5CS3                         2780
#define T5CLK_CS3                     2781
#define TMR3L0                        2782
#define TMR3L                         2783
#define TMR3L1                        2784
#define TMR3L2                        2785
#define TMR3L3                        2786
#define TMR3L4                        2787
#define TMR3L5                        2788
#define TMR3L6                        2789
#define TMR3L7                        2790
#define TMR3H                         2791
#define TMR3H0                        2792
#define TMR3H1                        2793
#define TMR3H2                        2794
#define TMR3H3                        2795
#define TMR3H4                        2796
#define TMR3H5                        2797
#define TMR3H6                        2798
#define TMR3H7                        2799
#define T3CON                         2800
#define T3CON_ON                      2801
#define TMR3ON                        2802
#define T3CON_RD16                    2803
#define RD163                         2804
#define T3RD16                        2805
#define T3CON_NOT_SYNC                2806
#define T3CON_nSYNC                   2807
#define NOT_T3SYNC                    2808
#define nT3SYNC                       2809
#define T3CKPS0                       2810
#define T3CON_CKPS0                   2811
#define T3CON_CKPS                    2812
#define T3CKPS1                       2813
#define T3CON_CKPS1                   2814
#define T3GCON                        2815
#define T3GVAL                        2816
#define T3GCON_GVAL                   2817
#define T3GGO                         2818
#define T3GGO_NOT_DONE                2819
#define T3GCON_GGO_nDONE              2820
#define T3GGO_nDONE                   2821
#define T3GCON_GGO_NOT_DONE           2822
#define T3GCON_GSPM                   2823
#define T3GSPM                        2824
#define T3GCON_GTM                    2825
#define T3GTM                         2826
#define T3GCON_GPOL                   2827
#define T3GPOL                        2828
#define T3GCON_GE                     2829
#define T3GE                          2830
#define T3GATE                        2831
#define T3GSS0                        2832
#define T3GATE_GSS0                   2833
#define T3GATE_GSS                    2834
#define T3GSS1                        2835
#define T3GATE_GSS1                   2836
#define T3GSS2                        2837
#define T3GATE_GSS2                   2838
#define T3GSS3                        2839
#define T3GATE_GSS3                   2840
#define T3CLK                         2841
#define T3CLK_CS                      2842
#define T3CLK_CS0                     2843
#define T3CS0                         2844
#define T3CLK_CS1                     2845
#define T3CS1                         2846
#define T3CLK_CS2                     2847
#define T3CS2                         2848
#define T3CS3                         2849
#define T3CLK_CS3                     2850
#define TMR1L                         2851
#define TMR1L0                        2852
#define TMR1L1                        2853
#define TMR1L2                        2854
#define TMR1L3                        2855
#define TMR1L4                        2856
#define TMR1L5                        2857
#define TMR1L6                        2858
#define TMR1L7                        2859
#define TMR1H0                        2860
#define TMR1H                         2861
#define TMR1H1                        2862
#define TMR1H2                        2863
#define TMR1H3                        2864
#define TMR1H4                        2865
#define TMR1H5                        2866
#define TMR1H6                        2867
#define TMR1H7                        2868
#define T1CON                         2869
#define TMR1ON                        2870
#define T1CON_ON                      2871
#define T1CON_RD16                    2872
#define T1RD16                        2873
#define NOT_T1SYNC                    2874
#define T1CON_nSYNC                   2875
#define nT1SYNC                       2876
#define T1CON_NOT_SYNC                2877
#define T1CON_CKPS0                   2878
#define T1CKPS0                       2879
#define T1CON_CKPS                    2880
#define T1CKPS1                       2881
#define T1CON_CKPS1                   2882
#define T1GCON                        2883
#define T1GCON_GVAL                   2884
#define T1GVAL                        2885
#define T1GGO_NOT_DONE                2886
#define T1GGO_nDONE                   2887
#define T1GCON_GGO_nDONE              2888
#define T1GCON_GGO_NOT_DONE           2889
#define T1GGO                         2890
#define T1GCON_GSPM                   2891
#define T1GSPM                        2892
#define T1GTM                         2893
#define T1GCON_GTM                    2894
#define T1GPOL                        2895
#define T1GCON_GPOL                   2896
#define T1GCON_GE                     2897
#define T1GE                          2898
#define T1GATE                        2899
#define T1GATE_GSS0                   2900
#define T1GSS0                        2901
#define T1GATE_GSS                    2902
#define T1GATE_GSS1                   2903
#define T1GSS1                        2904
#define T1GSS2                        2905
#define T1GATE_GSS2                   2906
#define T1GSS3                        2907
#define T1GATE_GSS3                   2908
#define T1CLK                         2909
#define T1CS0                         2910
#define T1CLK_CS                      2911
#define T1CLK_CS0                     2912
#define T1CLK_CS1                     2913
#define T1CS1                         2914
#define T1CS2                         2915
#define T1CLK_CS2                     2916
#define T1CS3                         2917
#define T1CLK_CS3                     2918
#define TMR0L0                        2919
#define TMR0L                         2920
#define TMR0L1                        2921
#define TMR0L2                        2922
#define TMR0L3                        2923
#define TMR0L4                        2924
#define TMR0L5                        2925
#define TMR0L6                        2926
#define TMR0L7                        2927
#define TMR0H0                        2928
#define T0PR                          2929
#define TMR0H                         2930
#define T0PR0                         2931
#define TMR0H1                        2932
#define T0PR1                         2933
#define TMR0H2                        2934
#define T0PR2                         2935
#define TMR0H3                        2936
#define T0PR3                         2937
#define TMR0H4                        2938
#define T0PR4                         2939
#define TMR0H5                        2940
#define T0PR5                         2941
#define TMR0H6                        2942
#define T0PR6                         2943
#define TMR0H7                        2944
#define T0PR7                         2945
#define T0CON0                        2946
#define T0OUTPS                       2947
#define T0OUTPS0                      2948
#define T0OUTPS1                      2949
#define T0OUTPS2                      2950
#define T0OUTPS3                      2951
#define T016BIT                       2952
#define T0OUT                         2953
#define T0EN                          2954
#define T0CON1                        2955
#define T0PS                          2956
#define T0CKPS                        2957
#define T0CKPS0                       2958
#define T0PS0                         2959
#define T0CKPS1                       2960
#define T0PS1                         2961
#define T0CKPS2                       2962
#define T0PS2                         2963
#define T0CKPS3                       2964
#define T0PS3                         2965
#define T0ASYNC                       2966
#define T0CS                          2967
#define T0CS0                         2968
#define T0CS1                         2969
#define T0CS2                         2970
#define PCON0                         2971
#define BOR                           2972
#define NOT_BOR                       2973
#define nBOR                          2974
#define POR                           2975
#define nPOR                          2976
#define NOT_POR                       2977
#define nRI                           2978
#define NOT_RI                        2979
#define RI                            2980
#define NOT_RMCLR                     2981
#define nRMCLR                        2982
#define RMCLR                         2983
#define NOT_RWDT                      2984
#define nRWDT                         2985
#define RWDT                          2986
#define nWDTWV                        2987
#define WDTWV                         2988
#define NOT_WDTWV                     2989
#define STKUNF                        2990
#define STKOVF                        2991
#define STATUS                        2992
#define C                             2993
#define CARRY                         2994
#define STATUS_DC                     2995
#define ZERO                          2996
#define Z                             2997
#define OV                            2998
#define OVERFLOW                      2999
#define N                             3000
#define NEGATIVE                      3001
#define PD                            3002
#define nPD                           3003
#define NOT_PD                        3004
#define TO                            3005
#define NOT_TO                        3006
#define nTO                           3007
#define FSR2L                         3008
#define PLUSW2                        3009
#define PREINC2                       3010
#define POSTDEC2                      3011
#define POSTINC2                      3012
#define INDF2                         3013
#define FSR1L                         3014
#define PLUSW1                        3015
#define PREINC1                       3016
#define POSTDEC1                      3017
#define POSTINC1                      3018
#define INDF1                         3019
#define WREG                          3020
#define FSR0L                         3021
#define PLUSW0                        3022
#define PREINC0                       3023
#define POSTDEC0                      3024
#define POSTINC0                      3025
#define INDF0                         3026
#define INTCON                        3027
#define INT0EDG                       3028
#define INT1EDG                       3029
#define INT2EDG                       3030
#define IPEN                          3031
#define PEIE                          3032
#define PEIE_GIEL                     3033
#define GIEL                          3034
#define GIE                           3035
#define GIE_GIEH                      3036
#define GIEH                          3037
#define PRODL                         3038
#define PRODH                         3039
#define TABLAT                        3040
#define TBLPTRL                       3041
#define TBLPTRH                       3042
#define TBLPTRU                       3043
#define ACSS                          3044
#define PCL                           3045
#define PCLATH                        3046
#define PCLATH_PCH                    3047
#define PCLATU                        3048
#define PCU                           3049
#define STKPTR0                       3050
#define STKPTR                        3051
#define SP0                           3052
#define STKPTR1                       3053
#define SP1                           3054
#define STKPTR2                       3055
#define SP2                           3056
#define SP3                           3057
#define STKPTR3                       3058
#define STKPTR4                       3059
#define SP4                           3060
#define STKPTR5                       3061
#define SP5                           3062
#define TOSL                          3063
#define TOSH                          3064

#endif // _PIC18LF47K40_H_
